Revit 2027 API
ParameterTypeId.SteelElemWeldMainThickness Property
 "Main Thickness"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemWeldMainThickness { get; }
Public Shared ReadOnly Property SteelElemWeldMainThickness As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemWeldMainThickness {
	ForgeTypeId^ get ();
}
static member SteelElemWeldMainThickness : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace